Updated the documentation
